# -*- coding: utf-8 -*-
"""
Created on Tue Dec 27 14:36:05 2016
以terminal_info表为基础来做扩展
@author: mzhang
"""

from sqlalchemy import create_engine
#日志对象
from utility import logger

#数据库连接
DB_CONN_STRING = 'oracle://trsenzhang:trsenzhang@192.168.56.112:1521/db'

import datetime
days = 1
CONF_ORDER_TIME = "sysdate -%s" % days


'''					
贷				
0.45%	         发卡=金额*0.45%			
0.410%	      成本=金额*0.41%			
0.407%	      成本=金额*0.407%			
0.2%保底0.3元	   成本=金额*0.2%，若小于0.3则取0.3	
0.3元一笔	      每笔成本都是0.3元一笔		
0.16%	         成本=金额*0.16%			
0.513%	      成本=金额*0.513%			
'''
CONF_LOAN_RATE_INFO={
        '0.45%':'1',
        '0.410%':'2',
        '0.407%':'3',
        '0.2%保底0.3元	':'4',
        '0.3元一笔':'5',
        '0.16%':'6',
        '0.513%':'7'
        }

'''
借 				
0.3一笔	      每笔成本都是0.3元一笔		  0.3
0.413%-17	   成本=金额*0.413%，若大于17则取17  if(成本>17){17}else{amount*0.413%}	
0.309%-13.28	成本=金额*0.309%，若大于13.28则取13.28
0.31%-14	      成本=金额*0.31%，若大于14则取14	
0.18%保底0.3	   成本=金额*0.18%，若小于0.3则取0.3	
0.393%-16.85	成本=金额*0.393%，若大于16.85则取16.85
0.312%-13.28	成本=金额*0.312%，若大于13.28则取13.28
0.309%-13.68	成本=金额*0.309%，若大于13.68则取13.68
0.16%	         成本=金额*0.16%			
0.35%13元封顶  	发卡=金额*0.35%，若大于13则取13
'''
CONF_BORROW_RATE_INFO={
        '0.3一笔':'1',
        '0.413%-17':'2',
        '0.309%-13.28':'3',
        '0.31%-14':'4',
        '0.18%保底0.3':'5',
        '0.393%-16.85':'6',
        '0.312%-13.28':'7',
        '0.309%-13.68':'8',
        '0.16%':'9',
        '0.35%13元封顶':'10'
        }

#列名别名配置信息
CONF_RATE_ALIAES_NAME = {
                         'big_merch_number':'商户号',
                       'from_card_type':'支付卡类型',
                       'pay_amount':'支付金额',
                       'trans_charge':'手续费',
                       'merch_name':'商户名',
                       'r_borrow':'借记卡',
                       'r_loan':'贷记卡',
                       'r_yinlian':'银联',
                       'channel_name':'通道名',
                       'type':'类型',
                       'area_32':'区域32',
                       'beizhu':'备注',
                       'COST':'成本',
                       'GRAIN':'利润'
                           }